#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

random_id.default: Refreshing state... [id=FqvWU-OuleQ]
data.archive_file.easee-source-archive: Reading...
data.archive_file.easee-source-archive: Read complete after 0s [id=bf162f50e8ecf923ce857fd5377aa0637603f552]
google_service_account.easee-controller: Refreshing state... [id=projects/savemyfuse/serviceAccounts/easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
data.google_project.project: Reading...
google_service_account.eventarc: Refreshing state... [id=projects/savemyfuse/serviceAccounts/eventarc-trigger-sa@savemyfuse.iam.gserviceaccount.com]
google_monitoring_notification_channel.email: Refreshing state... [id=projects/savemyfuse/notificationChannels/15333600777105280672]
google_monitoring_notification_channel.chat[0]: Refreshing state... [id=projects/savemyfuse/notificationChannels/12384810589887231529]
google_pubsub_topic.measurements_topic: Refreshing state... [id=projects/savemyfuse/topics/measurements]
google_storage_bucket.default: Refreshing state... [id=16abd653e3ae95e4-gcf-source]
google_storage_bucket_object.object: Refreshing state... [id=16abd653e3ae95e4-gcf-source-easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip]
data.google_project.project: Read complete after 0s [id=projects/savemyfuse]
google_project_iam_member.controller-role["roles/logging.logWriter"]: Refreshing state... [id=savemyfuse/roles/logging.logWriter/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_project_iam_member.controller-role["roles/secretmanager.secretAccessor"]: Refreshing state... [id=savemyfuse/roles/secretmanager.secretAccessor/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_firestore_database.database: Refreshing state... [id=projects/savemyfuse/databases/(default)]
google_project_iam_member.runinvoker: Refreshing state... [id=savemyfuse/roles/run.invoker/serviceAccount:eventarc-trigger-sa@savemyfuse.iam.gserviceaccount.com]
google_project_iam_member.controller-role["roles/pubsub.subscriber"]: Refreshing state... [id=savemyfuse/roles/pubsub.subscriber/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_project_iam_member.controller-role["roles/artifactregistry.createOnPushWriter"]: Refreshing state... [id=savemyfuse/roles/artifactregistry.createOnPushWriter/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_project_iam_member.controller-role["roles/datastore.user"]: Refreshing state... [id=savemyfuse/roles/datastore.user/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_project_iam_member.controller-role["roles/storage.objectAdmin"]: Refreshing state... [id=savemyfuse/roles/storage.objectAdmin/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_project_iam_member.controller-role["roles/eventarc.eventReceiver"]: Refreshing state... [id=savemyfuse/roles/eventarc.eventReceiver/serviceAccount:easee-controller-sa@savemyfuse.iam.gserviceaccount.com]
google_cloudfunctions2_function.easee-control-func: Refreshing state... [id=projects/savemyfuse/locations/europe-north1/functions/function-easee-control]
google_project_iam_member.eventreceiver: Refreshing state... [id=savemyfuse/roles/eventarc.eventReceiver/serviceAccount:eventarc-trigger-sa@savemyfuse.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions2_function.easee-control-func will be updated in-place
  ~ resource "google_cloudfunctions2_function" "easee-control-func" {
        id               = "projects/savemyfuse/locations/europe-north1/functions/function-easee-control"
        name             = "function-easee-control"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip" -> "easee-control-3139fcf51d1100927278f1ce0dddca0bff66ccbceb9d6b12160d781332f94d59.zip"
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_storage_bucket_object.object must be replaced
-/+ resource "google_storage_bucket_object" "object" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "erf1Zw==" -> (known after apply)
      ~ detect_md5hash      = "8c5MxZiFQFsvnvmZGZc9pw==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1758611119346218 -> (known after apply)
      ~ id                  = "16abd653e3ae95e4-gcf-source-easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "8c5MxZiFQFsvnvmZGZc9pw==" -> (known after apply)
      ~ md5hexhash          = "f1ce4cc59885405b2f9ef99919973da7" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/16abd653e3ae95e4-gcf-source/o/easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip?generation=1758611119346218&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip" -> "easee-control-3139fcf51d1100927278f1ce0dddca0bff66ccbceb9d6b12160d781332f94d59.zip" # forces replacement
      ~ output_name         = "easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/16abd653e3ae95e4-gcf-source/o/easee-control-7626e368dea9b20b568ef1b019bb9cd0266983e8fa97f423bcd60bf8dbc0c7da.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @ztamas83, Action: `pull_request`, Working Directory: `./tf-service`, Workflow: `Deploy service to Google Cloud`*